In [1]:
import pandas as pd

In [2]:
df = pd.read_excel("Excel_data.xlsx")
df

      ID       Name   Age         Profession  salary
0      1     olivia  23.0            Teacher  184518
1      2  sophia     20.0              Boxer  119572
2      3       jake  38.0          Scientist  174897
3      4      Rocky  56.0               Chef  117920
4      4      Rocky  56.0               Chef  117920
..   ...        ...   ...                ...     ...
495  496       John  45.0              Boxer  137929
496  497   Sherlock  46.0              Boxer   39870
497  498   Sherlock  47.0          Detective  165951
498  499     Olivia  55.0           Comedian  192618
499  500   Sherlock  59.0  Software Engineer  194886

[500 rows x 5 columns]

In [3]:
df.columns

Index(['ID', 'Name', 'Age', 'Profession', 'salary'], dtype='object')

In [5]:
df.columns = df.columns.str.title()
df.columns

Index(['Id', 'Name', 'Age', 'Profession', 'Salary'], dtype='object')

In [6]:
df

      Id       Name   Age         Profession  Salary
0      1     olivia  23.0            Teacher  184518
1      2  sophia     20.0              Boxer  119572
2      3       jake  38.0          Scientist  174897
3      4      Rocky  56.0               Chef  117920
4      4      Rocky  56.0               Chef  117920
..   ...        ...   ...                ...     ...
495  496       John  45.0              Boxer  137929
496  497   Sherlock  46.0              Boxer   39870
497  498   Sherlock  47.0          Detective  165951
498  499     Olivia  55.0           Comedian  192618
499  500   Sherlock  59.0  Software Engineer  194886

[500 rows x 5 columns]

In [7]:
df['Name'] = df['Name'].str.lower()

In [8]:
df

      Id       Name   Age         Profession  Salary
0      1     olivia  23.0            Teacher  184518
1      2  sophia     20.0              Boxer  119572
2      3       jake  38.0          Scientist  174897
3      4      rocky  56.0               Chef  117920
4      4      rocky  56.0               Chef  117920
..   ...        ...   ...                ...     ...
495  496       john  45.0              Boxer  137929
496  497   sherlock  46.0              Boxer   39870
497  498   sherlock  47.0          Detective  165951
498  499     olivia  55.0           Comedian  192618
499  500   sherlock  59.0  Software Engineer  194886

[500 rows x 5 columns]

In [10]:
df.Profession.unique()

array(['Teacher', '      Boxer', 'Scientist', 'Chef', 'Doctor', 'Artist',
       'Comedian', 'Software Engineer', 'Detective', 'Pilot'],
      dtype=object)

In [11]:
df['Profession'] = df.Profession.str.strip()

In [12]:
df.Profession.unique()

array(['Teacher', 'Boxer', 'Scientist', 'Chef', 'Doctor', 'Artist',
       'Comedian', 'Software Engineer', 'Detective', 'Pilot'],
      dtype=object)